export const synonyms: Record<string, string[]> = {
  'микроволновая печь': [
    'свч',
    'микроволновка',
    'микроволновая печь',
    'встраиваемая микроволновая печь',
    'отдельностоящая микроволновая печь'
  ],
  'духовой шкаф': [
    'духовка',
    'духовой шкаф',
    'электрический духовой шкаф',
    'газовый духовой шкаф',
    'компактный духовой шкаф'
  ],
  'варочная поверхность': [
    'варочная поверхность',
    'варочная панель',
    'варка',
    'индукция',
    'индукционная поверхность',
    'газовая поверхность',
    'электрическая поверхность',
    'стеклокерамическая поверхность',
    'комбинированная поверхность'
  ],
  'посудомоечная машина': [
    'посудомойка',
    'посудомоечная машина',
    'встраиваемая посудомоечная машина',
    'отдельностоящая посудомоечная машина',
    'компактная посудомоечная машина'
  ],
  холодильник: [
    'холодильник',
    'холодильная камера',
    'морозильник',
    'морозилка',
    'морозильная камера',
    'side by side',
    'сайд бай сайд'
  ],
  'стиральная машина': [
    'стиральная машина',
    'стиралка',
    'стирально сушильная машина',
    'стирально-сушильная машина',
    'встраиваемая стиральная машина'
  ],
  'сушильная машина': ['сушильная машина', 'сушилка', 'сушильный шкаф'],
  кофемашина: ['кофемашина', 'встраиваемая кофемашина', 'кофеварка'],
  вытяжка: [
    'вытяжка',
    'кухонная вытяжка',
    'вытяжка в шкаф',
    'телескопическая вытяжка',
    'наклонная вытяжка',
    'островная вытяжка',
    'пристенная вытяжка'
  ],
  гриль: ['гриль', 'электрический гриль', 'встраиваемый гриль', 'аэрогриль', 'барбекю'],
  мясорубка: ['мясорубка'],
  'кухонный комбайн': ['кухонный комбайн', 'комбайн'],
  соковыжималка: ['соковыжималка'],
  миксер: ['миксер', 'блендер'],
  утюг: ['утюг', 'отпариватель', 'паровая станция', 'гладильная станция'],
  тостер: ['тостер', 'вафельница'],
  'вакуумный упаковщик': ['вакуумный упаковщик'],
  водонагреватель: [
    'водонагреватель',
    'накопительный водонагреватель',
    'проточный водонагреватель',
    'бойлер'
  ],
  фильтр: ['фильтр', 'фильтр для воды', 'фильтр для кофемашины'],
  смеситель: [
    'смеситель',
    'смеситель под гранит',
    'смеситель из металла',
    'смеситель хром гранит',
    'смеситель хром/гранит'
  ],
  мойка: [
    'мойка',
    'кухонная мойка',
    'гранитная мойка',
    'мойка из нержавеющей стали',
    'керамическая мойка'
  ],
  аксессуары: ['аксессуары', 'запчасти', 'фильтры', 'комплектующие'],
  весы: ['весы', 'весы кухонные', 'весы напольные'],
  обогреватель: ['обогреватель', 'конвектор'],
  кондиционер: ['кондиционер', 'сплит система', 'сплит-система'],
  увлажнитель: ['увлажнитель', 'осушитель воздуха'],
  вентилятор: ['вентилятор'],
  'кухонная техника': [
    'кухонная техника',
    'кофемашина',
    'миксер',
    'блендер',
    'кухонный комбайн',
    'соковыжималка',
    'мясорубка',
    'гриль',
    'хлебопечь',
    'термопот'
  ]
};
